# People Analytic Project - Colacho Company, Inc

## 1. Import Libraries

In [1]:
import pandas as pd
import numpy as np
import random
import string
from faker import Faker
from datetime import datetime

fake = Faker()

## 2. Create the data frame

We are going to simulate a database composed be hundred employees

In [2]:
# Let's create a list with the names and other list with their surnames
names = [
    'John', 'Emily', 'Michael', 'Sarah', 'David', 'Jessica', 'Daniel', 'Olivia', 'Christopher', 'Sophia',
    'Matthew', 'Ava', 'Andrew', 'Emma', 'James', 'Isabella', 'Joseph', 'Mia', 'Anthony', 'Abigail',
    'Robert', 'Charlotte', 'William', 'Amelia', 'David', 'Evelyn', 'Alexander', 'Harper', 'Thomas', 'Grace',
    'Ethan', 'Chloe', 'Steven', 'Ella', 'Richard', 'Victoria', 'Ryan', 'Avery', 'Charles', 'Sofia',
    'Edward', 'Scarlett', 'George', 'Madison', 'Samuel', 'Lily', 'Jackson', 'Aria', 'Henry', 'Lillian',
    'Owen', 'Addison', 'Sebastian', 'Aubrey', 'Benjamin', 'Natalie', 'Nicholas', 'Zoey', 'Daniel', 'Hannah',
    'Aiden', 'Brooklyn', 'Adam', 'Stella', 'Dylan', 'Nora', 'Wyatt', 'Leah', 'Caleb', 'Audrey',
    'Nathan', 'Claire', 'Jayden', 'Ellie', 'Zachary', 'Savannah', 'Carter', 'Skylar', 'Luke', 'Riley',
    'Isaac', 'Aaliyah', 'Christian', 'Penelope', 'Liam', 'Camila', 'Julian', 'Ariana', 'Gabriel', 'Kennedy',
    'Levi', 'Maya', 'Jaxon', 'Gabriella', 'Aaron', 'Madelyn', 'Brayden', 'Elena', 'Oliver', 'Anna'
]

surnames = [
    'Smith', 'Johnson', 'Williams', 'Jones', 'Brown', 'Davis', 'Miller', 'Wilson', 'Moore', 'Taylor',
    'Anderson', 'Thomas', 'Jackson', 'White', 'Harris', 'Martin', 'Thompson', 'Garcia', 'Martinez', 'Robinson',
    'Clark', 'Rodriguez', 'Lewis', 'Lee', 'Walker', 'Hall', 'Allen', 'Young', 'Hernandez', 'King',
    'Wright', 'Lopez', 'Hill', 'Scott', 'Green', 'Adams', 'Baker', 'Gonzalez', 'Nelson', 'Carter',
    'Mitchell', 'Perez', 'Roberts', 'Turner', 'Phillips', 'Campbell', 'Parker', 'Evans', 'Edwards', 'Collins',
    'Stewart', 'Sanchez', 'Morris', 'Rogers', 'Reed', 'Cook', 'Morgan', 'Bell', 'Murphy', 'Bailey',
    'Rivera', 'Cooper', 'Richardson', 'Cox', 'Howard', 'Ward', 'Torres', 'Peterson', 'Gray', 'Ramirez',
    'James', 'Watson', 'Brooks', 'Kelly', 'Sanders', 'Price', 'Bennett', 'Wood', 'Barnes', 'Ross',
    'Henderson', 'Coleman', 'Jenkins', 'Perry', 'Powell', 'Long', 'Patterson', 'Hughes', 'Flores', 'Washington',
    'Butler', 'Simmons', 'Foster', 'Gonzales', 'Bryant', 'Alexander', 'Russell', 'Griffin', 'Diaz', 'Hayes'
]

sex = [
    'male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female','male','female'
]


# Create our data frame
colacho_df = pd.DataFrame({
    'Name': names,
    'Surname': surnames,
    'Gender': sex
})

# Checking if everything is ok
print(colacho_df.head())

      Name   Surname  Gender
0     John     Smith    male
1    Emily   Johnson  female
2  Michael  Williams    male
3    Sarah     Jones  female
4    David     Brown    male

### 2.1 Create new columns

Now we are going to create new columns, work department, id, address, birthdate, and age

#### 2.1.a Work Departments Column

Here we are going to create a random sequence of values from 1 to 5, and then we are going to replace those values with the department's names

In [3]:
# Random values to replace later
work_department = np.random.randint(1, 5, size=100)
colacho_df['WorkDepartment'] = work_department

# Its time to replace the values with the areas where people are from
department_map = {
    1: 'HHRR',
    2: 'Sales',
    3: 'Account',
    4: 'Marketing',
    5: 'Operations'
}

colacho_df['WorkDepartment'] = colacho_df['WorkDepartment'].map(department_map)

# Let's see if everthing is OK
print(colacho_df.head(10))

          Name   Surname  Gender WorkDepartment
0         John     Smith    male          Sales
1        Emily   Johnson  female      Marketing
2      Michael  Williams    male          Sales
3        Sarah     Jones  female          Sales
4        David     Brown    male      Marketing
5      Jessica     Davis  female      Marketing
6       Daniel    Miller    male      Marketing
7       Olivia    Wilson  female      Marketing
8  Christopher     Moore    male          Sales
9       Sophia    Taylor  female        Account

#### 2.1.b ID column

For this column, we are going to create a random ID that will combine numbers with letters, we will use libraries random and string

In [4]:
# Let's create to function to get the Id
def generate_id():
    letters = string.ascii_letters.upper()
    numbers = string.digits
    random_letters = ''.join(random.choice(letters) for i in range(2))
    random_numbers = ''.join(random.choice(numbers) for i in range(4))
    return random_letters + random_numbers

# Our ID column with their random values
colacho_df['ID'] = colacho_df.apply(lambda row: generate_id(), axis=1)

# Checking if works fine
# print(colacho_df.head(10))
colacho_df

       Name    Surname  Gender WorkDepartment      ID
0      John      Smith    male          Sales  GC9893
1     Emily    Johnson  female      Marketing  BI7199
2   Michael   Williams    male          Sales  GK9359
3     Sarah      Jones  female          Sales  JG6458
4     David      Brown    male      Marketing  NW1028
..      ...        ...     ...            ...     ...
95  Madelyn  Alexander  female        Account  AM4257
96  Brayden    Russell    male          Sales  PP5330
97    Elena    Griffin  female        Account  GW6266
98   Oliver       Diaz    male          Sales  SU3775
99     Anna      Hayes  female        Account  IA2241

[100 rows x 5 columns]

#### 2.1.c Address Column

Let's use faker to insert the values for the address column

In [5]:
# Generate the fake address for the employees
Faker.seed(0)
address = [fake.street_address() for i in range(100)]
print(address)

colacho_df['Address'] = address
colacho_df['Address']

['0487 Hull Village Suite 759', '242 Christine Glen', '1157 Michael Island', '778 Brown Plaza', '60975 Jessica Squares', '93328 Davis Island', '48418 Olsen Plains Apt. 989', '1965 Kelly Field Apt. 094', '12201 Massey Pine Suite 833', '477 Miller Ridge Apt. 795', '04135 Marvin Via', '23098 Anthony Roads', '916 Mitchell Crescent', '032 Timothy Stream', '086 Mary Cliff', '45620 Williams Courts', '45792 Tammy Centers Apt. 258', '97207 Mccullough Well Suite 564', '071 Stevenson Plains', '37594 Garza Roads Apt. 466', '93523 Dana Lane', '69602 Brown Squares Apt. 787', '75470 Lopez Roads', '206 Stewart Forest', '089 James Rest', '4217 Burton Brooks', '1428 Wilson Drives Suite 000', '485 Mays Vista', '977 Watson Plain', '69402 Joseph Junction', '159 Blake Estates Apt. 945', '241 Cross Causeway Suite 281', '5461 Ann Orchard Suite 551', '76045 Samantha Road Suite 111', '306 Corey Point', '7936 Micheal Green Apt. 635', '08731 Sanders Fords', '92137 Ward Views', '97296 Rich Park', '7389 Alec Squares Suite 508', '9269 Robbins Valley', '18013 Billy Bridge Suite 522', '8688 Audrey Springs Apt. 634', '6993 Diane Alley Apt. 489', '1744 Cruz Lights Apt. 223', '500 Butler Overpass Apt. 256', '767 Craig Tunnel', '09925 Isabel Run', '67109 Mendez Junction Apt. 942', '1830 Wallace Throughway Apt. 751', '74089 Jerry Trail', '412 Snow Manors Apt. 161', '2076 Johnson Way', '415 David Square Apt. 552', '51923 Jamie Spring', '045 Sarah Fort', '71754 Anthony Fords', '7448 White Common Apt. 894', '2235 Joel Ferry', '6029 Phillip Squares Apt. 264', '296 Walsh Corner Apt. 758', '6065 Harris Hill', '21418 Laura Mission Suite 266', '75825 Welch Corners', '40797 Jeffery Crescent Suite 892', '717 Amy Lodge Suite 014', '46896 Garcia Glen', '3910 Laura Inlet Suite 183', '64482 Amanda Loop', '447 Carroll Dam Apt. 116', '728 Gomez Mountains Suite 377', '0742 Williams Road Apt. 057', '81160 Williams River Apt. 443', '431 Murray Isle', '56627 Alexandria Curve Apt. 275', '7633 Bentley Radial Apt. 603', '50239 Salazar Squares', '6708 Carpenter Overpass Suite 735', '00250 Pena Dam Apt. 639', '373 Franklin Rest Apt. 558', '4080 Miguel Fords Suite 334', '8647 Wiggins Garden Apt. 481', '7706 Stevens Crest', '31263 Salazar Viaduct', '602 Tracy Crossroad Suite 556', '498 Jennifer Tunnel', '978 Nelson Brook Apt. 912', '34088 Trevino Crossing Suite 419', '84331 Leonard Fort Suite 749', '08855 Lisa Wells', '28123 Hudson Square Apt. 323', '9927 Christina Burg Suite 774', '82778 Padilla Common', '96354 Acevedo Fords Apt. 535', '345 Kevin Knolls Apt. 250', '003 Alexander Shoal Suite 105', '37625 Thompson Isle Suite 606', '870 Robert Loaf Apt. 082', '53230 Julia Villages', '169 Christine Mount']

0       0487 Hull Village Suite 759
1                242 Christine Glen
2               1157 Michael Island
3                   778 Brown Plaza
4             60975 Jessica Squares
                  ...
95    003 Alexander Shoal Suite 105
96    37625 Thompson Isle Suite 606
97         870 Robert Loaf Apt. 082
98             53230 Julia Villages
99              169 Christine Mount
Name: Address, Length: 100, dtype: object

#### 2.1.d Birthday Column

With faker let's create the birthday column from our employees

In [6]:
# Let's put the values into a variable
birthday = [fake.date_of_birth(minimum_age=20, maximum_age=68) for i in range(100)]
print(birthday)

colacho_df['Birthday'] = birthday
colacho_df

[datetime.date(2003, 4, 5), datetime.date(1965, 2, 24), datetime.date(1996, 10, 13), datetime.date(1995, 11, 26), datetime.date(1957, 8, 30), datetime.date(1972, 2, 13), datetime.date(1978, 2, 2), datetime.date(1980, 7, 23), datetime.date(1956, 10, 16), datetime.date(1997, 7, 9), datetime.date(1957, 5, 29), datetime.date(1988, 9, 17), datetime.date(1961, 1, 13), datetime.date(1979, 4, 29), datetime.date(1974, 11, 9), datetime.date(2000, 8, 22), datetime.date(1965, 3, 14), datetime.date(1986, 2, 10), datetime.date(1971, 1, 3), datetime.date(1989, 6, 20), datetime.date(1979, 2, 24), datetime.date(1965, 12, 24), datetime.date(1982, 6, 24), datetime.date(1977, 11, 30), datetime.date(1973, 4, 19), datetime.date(1988, 6, 9), datetime.date(1981, 8, 26), datetime.date(1955, 12, 11), datetime.date(1976, 2, 1), datetime.date(1991, 1, 10), datetime.date(1974, 7, 20), datetime.date(1992, 5, 24), datetime.date(1986, 11, 6), datetime.date(1957, 4, 25), datetime.date(1991, 2, 15), datetime.date(1993, 10, 4), datetime.date(1992, 7, 4), datetime.date(1972, 10, 18), datetime.date(2001, 9, 4), datetime.date(1957, 7, 17), datetime.date(1985, 12, 17), datetime.date(1981, 10, 27), datetime.date(1963, 2, 8), datetime.date(1982, 5, 31), datetime.date(1978, 7, 10), datetime.date(1988, 9, 9), datetime.date(1958, 6, 2), datetime.date(1956, 5, 6), datetime.date(1973, 7, 8), datetime.date(1957, 4, 8), datetime.date(1972, 3, 20), datetime.date(2001, 4, 5), datetime.date(2001, 3, 28), datetime.date(1994, 7, 17), datetime.date(2002, 10, 3), datetime.date(1974, 8, 28), datetime.date(2001, 8, 17), datetime.date(1969, 1, 11), datetime.date(1990, 12, 15), datetime.date(1990, 1, 25), datetime.date(1978, 2, 3), datetime.date(1981, 3, 17), datetime.date(1971, 12, 29), datetime.date(1969, 2, 26), datetime.date(1962, 10, 31), datetime.date(1993, 6, 15), datetime.date(1977, 5, 10), datetime.date(1971, 6, 14), datetime.date(1994, 10, 28), datetime.date(2000, 10, 16), datetime.date(1991, 3, 12), datetime.date(2001, 4, 20), datetime.date(1978, 12, 25), datetime.date(1965, 12, 31), datetime.date(1965, 5, 9), datetime.date(1977, 6, 9), datetime.date(1955, 7, 22), datetime.date(1994, 9, 28), datetime.date(1958, 6, 4), datetime.date(1993, 5, 17), datetime.date(1965, 7, 25), datetime.date(1978, 5, 21), datetime.date(1979, 8, 27), datetime.date(1974, 10, 2), datetime.date(1997, 7, 8), datetime.date(1974, 11, 27), datetime.date(1976, 12, 1), datetime.date(1988, 8, 11), datetime.date(1982, 5, 28), datetime.date(1995, 10, 25), datetime.date(1984, 4, 7), datetime.date(1966, 7, 5), datetime.date(1955, 1, 3), datetime.date(1964, 7, 7), datetime.date(1993, 8, 18), datetime.date(1957, 11, 26), datetime.date(1985, 1, 3), datetime.date(1963, 7, 2), datetime.date(1978, 3, 2), datetime.date(1955, 7, 28)]

,Name,Surname,Gender,WorkDepartment,ID,Address,Birthday
0,John,Smith,male,Sales,GC9893,0487 Hull Village Suite 759,2003-04-05
1,Emily,Johnson,female,Marketing,BI7199,242 Christine Glen,1965-02-24
2,Michael,Williams,male,Sales,GK9359,1157 Michael Island,1996-10-13
3,Sarah,Jones,female,Sales,JG6458,778 Brown Plaza,1995-11-26
4,David,Brown,male,Marketing,NW1028,60975 Jessica Squares,1957-08-30
...,...,...,...,...,...,...,...
95,Madelyn,Alexander,female,Account,AM4257,003 Alexander Shoal Suite 105,1957-11-26
96,Brayden,Russell,male,Sales,PP5330,37625 Thompson Isle Suite 606,1985-01-03
97,Elena,Griffin,female,Account,GW6266,870 Robert Loaf Apt. 082,1963-07-02
98,Oliver,Diaz,male,Sales,SU3775,53230 Julia Villages,1978-03-02
99,Anna,Hayes,female,Account,IA2241,169 Christine Mount,1955-07-28

#### 2.1.e Age column

For this task, we are going to take the dates from the Birthday column and using datetime.now() we are going to calculate the Age of our employees  Then add the values to the database in the column "Age".

In [9]:
# Convert 'birthday' column to datetime
colacho_df['Birthday'] = pd.to_datetime(colacho_df['Birthday'])

# Calculate the age based on today's date
today = datetime.now()
# age = np.random.randint(20, 68, size=100)
colacho_df['Age'] = today.year - colacho_df['Birthday'].dt.year - ((today.month < colacho_df['Birthday'].dt.month) | ((today.month == colacho_df['Birthday'].dt.month) & (today.day < colacho_df['Birthday'].dt.day)))

# Checking if everything is OK
colacho_df

,Name,Surname,Gender,WorkDepartment,ID,Address,Birthday,Age
0,John,Smith,male,Sales,GC9893,0487 Hull Village Suite 759,2003-04-05,20
1,Emily,Johnson,female,Marketing,BI7199,242 Christine Glen,1965-02-24,58
2,Michael,Williams,male,Sales,GK9359,1157 Michael Island,1996-10-13,27
3,Sarah,Jones,female,Sales,JG6458,778 Brown Plaza,1995-11-26,28
4,David,Brown,male,Marketing,NW1028,60975 Jessica Squares,1957-08-30,66
...,...,...,...,...,...,...,...,...
95,Madelyn,Alexander,female,Account,AM4257,003 Alexander Shoal Suite 105,1957-11-26,66
96,Brayden,Russell,male,Sales,PP5330,37625 Thompson Isle Suite 606,1985-01-03,38
97,Elena,Griffin,female,Account,GW6266,870 Robert Loaf Apt. 082,1963-07-02,60
98,Oliver,Diaz,male,Sales,SU3775,53230 Julia Villages,1978-03-02,45
99,Anna,Hayes,female,Account,IA2241,169 Christine Mount,1955-07-28,68

#### 2.1.f Saving our dataset

Because we are going to use our data for other purposes, we need to save our dataset, because some columns have random values and we don't want to change the data every time we restart the program.

In [13]:
# Before saving our data, let's check our data
colacho_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            100 non-null    object
 1   Surname         100 non-null    object
 2   Gender          100 non-null    object
 3   WorkDepartment  100 non-null    object
 4   ID              100 non-null    object
 5   Address         100 non-null    object
 6   Birthday        100 non-null    datetime64[ns]
 7   Age             100 non-null    int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 6.4+ KB

In [14]:
# Checking for missing values
colacho_df.isna()

     Name  Surname  Gender  WorkDepartment     ID  Address  Birthday    Age
0   False    False   False           False  False    False     False  False
1   False    False   False           False  False    False     False  False
2   False    False   False           False  False    False     False  False
3   False    False   False           False  False    False     False  False
4   False    False   False           False  False    False     False  False
..    ...      ...     ...             ...    ...      ...       ...    ...
95  False    False   False           False  False    False     False  False
96  False    False   False           False  False    False     False  False
97  False    False   False           False  False    False     False  False
98  False    False   False           False  False    False     False  False
99  False    False   False           False  False    False     False  False

[100 rows x 8 columns]

In [ ]:
# Let's save the data in a .csv file
colacho_df.to_csv('colacho_database.csv', index=False)